{"ix_to_word": {"1": "inhale", "2": "as", "3": "you", "4": "extend", "5": "your", "6": "arms", "7": "overhead", "8": "reaching", "9": "fingertips", "10": "to", "11": "the", "12": "sky", "13": "raise", "14": "left", "15": "leg", "16": "front", "17": "of", "18": "body", "19": "keeping", "20": "it", "21": "straight", "22": "rotate", "23": "this", "24": "side", "25": "and", "26": "then", "27": "back", "28": "starting", "29": "position", "30": "right", "31": "while", "32": "simultaneously", "33": "bending", "34": "forward", "35": "at", "36": "waist", "37": "extending", "38": "arm", "39": "with", "40": "hand", "41": "toward", "42": "foot", "43": "skip", "44": "in", "45": "place", "46": "by", "47": "hopping", "48": "on", "49": "bringing", "50": "knee", "51": "up", "52": "level", "53": "hands", "54": "behind", "55": "head", "56": "bend", "57": "knees", "58": "until", "59": "thighs", "60": "are", "61": "parallel", "62": "ground", "63": "floor", "64": "step", "65": "out", "66": "clasped", "67": "chest", "68": "thigh", "69": "is", "70": "engaging", "71": "abdominals", "72": "pushing", "73": "weight", "74": "into", "75": "heel", "76": "slowly", "77": "stand", "78": "press", "79": "through", "80": "immediately", "81": "raising", "82": "assume", "83": "holding", "84": "a", "85": "barbell", "86": "across", "87": "traps", "88": "shoulders", "89": "take", "90": "large", "91": "using", "92": "push", "93": "return", "94": "pose", "95": "first", "96": "heels", "97": "them", "98": "shoulder", "99": "switch", "100": "sides", "101": "repeat", "102": "height", "103": "palms", "104": "still", "105": "facing", "106": "down", "107": "elbows", "108": "90", "109": "degree", "110": "without", "111": "moving", "112": "forearms", "113": "they", "114": "vertical", "115": "slightly", "116": "trunk", "117": "pull", "118": "from", "119": "above", "120": "straighten", "121": "both", "122": "curl", "123": "weights", "124": "close", "125": "approximately", "126": "45", "127": "degrees", "128": "inside", "129": "contact", "130": "flexed", "131": "hip", "132": "muscles", "133": "hold", "134": "for", "135": "5", "136": "seconds", "137": "sole", "138": "inner", "139": "calf", "140": "together", "141": "prayer", "142": "thumbs", "143": "resting", "144": "sternum", "145": "<bos>", "146": "<eos>", "147": "UNK", "148": ","}, "word_to_ix": {"inhale": 1, "as": 2, "you": 3, "extend": 4, "your": 5, "arms": 6, "overhead": 7, "reaching": 8, "fingertips": 9, "to": 10, "the": 11, "sky": 12, "raise": 13, "left": 14, "leg": 15, "front": 16, "of": 17, "body": 18, "keeping": 19, "it": 20, "straight": 21, "rotate": 22, "this": 23, "side": 24, "and": 25, "then": 26, "back": 27, "starting": 28, "position": 29, "right": 30, "while": 31, "simultaneously": 32, "bending": 33, "forward": 34, "at": 35, "waist": 36, "extending": 37, "arm": 38, "with": 39, "hand": 40, "toward": 41, "foot": 42, "skip": 43, "in": 44, "place": 45, "by": 46, "hopping": 47, "on": 48, "bringing": 49, "knee": 50, "up": 51, "level": 52, "hands": 53, "behind": 54, "head": 55, "bend": 56, "knees": 57, "until": 58, "thighs": 59, "are": 60, "parallel": 61, "ground": 62, "floor": 63, "step": 64, "out": 65, "clasped": 66, "chest": 67, "thigh": 68, "is": 69, "engaging": 70, "abdominals": 71, "pushing": 72, "weight": 73, "into": 74, "heel": 75, "slowly": 76, "stand": 77, "press": 78, "through": 79, "immediately": 80, "raising": 81, "assume": 82, "holding": 83, "a": 84, "barbell": 85, "across": 86, "traps": 87, "shoulders": 88, "take": 89, "large": 90, "using": 91, "push": 92, "return": 93, "pose": 94, "first": 95, "heels": 96, "them": 97, "shoulder": 98, "switch": 99, "sides": 100, "repeat": 101, "height": 102, "palms": 103, "still": 104, "facing": 105, "down": 106, "elbows": 107, "90": 108, "degree": 109, "without": 110, "moving": 111, "forearms": 112, "they": 113, "vertical": 114, "slightly": 115, "trunk": 116, "pull": 117, "from": 118, "above": 119, "straighten": 120, "both": 121, "curl": 122, "weights": 123, "close": 124, "approximately": 125, "45": 126, "degrees": 127, "inside": 128, "contact": 129, "flexed": 130, "hip": 131, "muscles": 132, "hold": 133, "for": 134, "5": 135, "seconds": 136, "sole": 137, "inner": 138, "calf": 139, "together": 140, "prayer": 141, "thumbs": 142, "resting": 143, "sternum": 144, "<bos>": 145, "<eos>": 146, "UNK": 147, ",": 148}}